<template>
  <div id="app">
    
    <read-more-indicator title="Читать далее"/>

    <div class="scroll-container"> 
      <!-- intro slide start -->
      <section class="slide slide--intro" id="intro">
        <div class="slide-background">
          <img src="./assets/images/slide-intro/background.jpg" alt="Истории людей, которые заявили о насилии со стороны милиции"/>
        </div>

        <div class="container" id="slideContentIntro">
          <header class="container-header"> 
            <h2 class="section-title">Сопротивление бесполезно</h2>
            <div class="section-description">Истории людей, которые заявили о насилии со стороны милиции</div>
          </header>

          <div class="container-i-text">
            <p>«Мы — защита граждан, а не карающий меч революции, как это раньше об органах ВЧК-НКВД говорили,» — слова нового министра внутренних дел Юрия Караева. Истории белорусов, которые заявили о насилии со стороны милиции и о которых рассказывает в своем фотопроекте Максим Сарычев, произошли более года назад. Во всех случаях герои пытаются доказать, что в отношении них были превышены служебные полномочия. Пока безрезультатно.</p>
            <p>Светлана встречала Новый год с друзьями и даже не предполагала, что ее задержит ОМОН. Домой она вернулась с сотрясением мозга. Сергей утверждает, как правоохранители вывезли его в лес, требуя, чтобы он выдал информацию о своих друзьях. Для Бориса ссора с женой закончилась вызовом милиции и применением газового баллончика. Татьяну заставили сдать отпечатки пальцев, удерживали силой, чтобы сфотографировать для базы правонарушителей.</p>
            <p>Мы не можем утверждать, что все происходило именно так, как описывают герои (ни один из случаев не дошел до суда), поэтому не приводим их прямую речь полностью. Мы считаем важным привлечь внимание к теме отношения отдельных сотрудников милиции к гражданам, потому что тоже считаем, что милиция — это защита, а не «карающий меч революции».</p>
            <p>Может ли милиция применить силу, может ли гражданин дать отпор и как отстоять свои права в таком конфликте?</p>
            <p>Пытки в Беларуси, как и во всех цивилизованных странах, запрещены, еще в 1987 году мы присоединились к Конвенции против пыток. Что такое пытка? Это любое действие должностного лица, которым человеку причиняется боль, физическое или психическое расстройство, чтобы заставить его или другого человека что-то сообщить, в чем-то признаться или чтобы его наказать.</p>
            <p>Может ли милиция применять силу? Может, если без силы остановить или задержать человека невозможно. Милиционер обязан предупредить нарушителя, за исключением случаев, когда промедление создает угрозу для жизни, может повлечь тяжкие последствия. Милиционер должен стремиться причинить наименьший вред и оказать первую помощь.</p>
          </div>
        </div>
      </section> 
      <!-- intro slide end    -->

      <!-- slide #1 start -->
      <section class="slide slide--01" id="history01">
        <div class="slide-background">
          <img src="./assets/images/slide-01/background.jpg" alt="Светлана Соколовская, 34 года, актриса, Минск">
        </div>

        <div class="container" id="slideContent01">
          <header class="container-header"> 
            <h2 class="section-title">Светлана Соколовская</h2>
            <div class="section-description">34 года, актриса, Минск</div>
          </header>

          <div class="container-i-text">
            <p>Светлана Соколовская 1 января 2018 года, в новогоднюю ночь, пошла с друзьями на праздничную елку. Сотрудники ОМОН не пустили компанию за огражденную территорию, возник спор, в результате чего молодых людей задержали.</p>
            <p>В интервью TUT.BY девушка рассказала, что когда сотрудник ОМОН закрывал дверь, то ударил ее, и она ушибла палец. Потом, по ее словам, последовал удар по голове, и она потеряла сознание. Позже врачи в документах укажут «закрытая черепно-мозговая травма легкой степени, сотрясение головного мозга, ушиб третьего пальца левой руки».</p>
            <p>Светлана написала заявление в Следственный комитет, в возбуждении уголовного дела отказано. Милиционеры отрицают, что применяли силу. Вывод судебно-медицинской экспертизы: Соколовская могла получить травму головы «в результате падения с высоты собственного роста как на плоскость, так и на выступающие предметы».</p>
            <p>В постановлении об отказе в возбуждении уголовного дела отмечено, что у Светланы была тяжелая степень опьянения. ПЦ «Весна» (лишен регистрации в Беларуси) обратился к спецдокладчику ООН по делу Светланы. Сейчас материалы проверки изучают в Центральном аппарате СК (в редакции есть ответ начальника отдела Заводского РОСК Минска, пдтверждающий данный факт).</p>
            <figure>
              <img src="./assets/images/slide-01/image-01.jpg" alt="Новогодняя елка, рядом с которой задержали Светлану с друзьями. Январь 2019, Минск, Беларусь.">
              <figcaption>Новогодняя елка, рядом с которой задержали Светлану с друзьями. Январь 2019, Минск, Беларусь.</figcaption>
            </figure>
          </div>

          <footer class="container-footer">
            <div class="container-i-text">
              <p>— Следователь был очень мил: улыбался, шутил, рассказывал анекдоты. Говорил, что если меня действительно ударил сотрудник ОМОНа, то это вопиющий случай, что никогда такого не было. Обещал разобраться как можно скорее, потому что у него тоже жена, дети, и он очень переживает в таких ситуациях. В результате он решил, что я сама упала и ударилась головой. Он вел себя так, как будто это не его решение.</p>
              <p>Я хочу добиться, чтобы наши защитники — ОМОН и милиция — в следующий раз думали, не лишат ли они себя работы. Безнаказанность порождает еще большую волну насилия.</p>
            </div>
          </footer>
        </div>
      </section>
      <!-- slide #1 end -->
        
      <!-- slide #2 start -->
      <section class="slide slide--02" id="history02">
        <div class="slide-background">
          <img src="./assets/images/slide-02/background.jpg" alt="Сергей Созонович, 23 года, музыкант, Столин">
        </div>

        <div class="container" id="slideContent02">
          <header class="container-header"> 
            <h2 class="section-title">Сергей Созонович</h2>
            <div class="section-description">23 года, музыкант, Столин</div>
          </header>

          <div class="container-i-text">
            <p>У Сергея было несколько правонарушений, в том числе за граффити с надписью, направленной против милиции. В один день милиционеры приехали к его на работу отцу, вместе нашли Сергея.</p>
            <p>Парень говорит, что милиционеры три часа пытались выведать у него информацию о друзьях и знакомых из музыкальной среды, угрожали физической расправой, смотрели фото на его телефоне. После этого, как утверждает Сергей, правоохранители вывезли его в лес и приставили к спине пистолет.</p>
            <p>Следственный комитет отказал в возбуждении уголовного дела: в действиях сотрудников милиции не нашли состава преступления (копия постановления есть в редакции).</p>
            <figure>
              <img src="./assets/images/slide-02/image-01.jpg" alt="Лесная дорога, где, по словам Сергея, все происходило. Столин, Беларусь, ноябрь 2018 г.">
              <figcaption>Лесная дорога, где, по словам Сергея, все происходило. Столин, Беларусь, ноябрь 2018 г.</figcaption>
            </figure>
          </div>

          <footer class="container-footer">
            <div class="container-i-text">
              <p>— Вначале мне было страшно даже в СМИ обращаться. Мне казалось, если я сейчас об этом расскажу, они приедут снова и будет хуже. Я не знаю, что бы они могли сделать. Мне хотелось, чтобы от меня отстали. (...) У меня ненависть не к этим людям, а к тому, что подтолкнуло их к такому поступку, — говорит Сергей. — Что это? Страх перед начальством, страх быть обычными людьми, потерять работу…</p>
            </div>
          </footer>
        </div>
      </section>
      <!-- slide #2 end -->
        
      <!-- slide #3 start -->
      <section class="slide slide--03" id="history03">
        <div class="slide-background">
          <img src="./assets/images/slide-03/background.jpg" alt="Борис Змитрович, 30 лет, водитель, Сморгонь">
        </div>

        <div class="container" id="slideContent03">
          <header class="container-header"> 
            <h2 class="section-title">Борис Змитрович</h2>
            <div class="section-description">30 лет, водитель, Сморгонь</div>
          </header>

          <div class="container-i-text">
            <p>Что произошло? Борис рассказывает, что милиция задержала его ночью 14 января 2018 года, когда он возвращался с юбилея отца. Во время празднования он выпил около 300 граммов водки. На выходе из ресторана поссорился с женой, и она вызвала милицию. Борис отказался ехать в отделение. Во время задержания сотрудники использовали слезоточивый газ, повалили его на землю и избили ногами. В отделении, вспоминает мужчина, ему разбили нос. Судебно-медицинская экспертиза зафиксировала химические ожоги лица и глаз, многочисленные телесные повреждения и гематому в районе носа (в редакции есть копия заключения).</p>
            <p>Борис подавал жалобы в СК, прокуратуру и Управление собственной безопасности МВД — повсюду получил отказ. Сейчас он в четвертый раз обжалует отказ Следственного комитета на возбуждение уголовного дела.</p>
            <figure>
              <img src="./assets/images/slide-03/image-01.jpg" alt="Скриншот видео с камеры наблюдения из отделения милиции. Борис утверждает, что 20 секунд записи исчезли. Борис на полу посреди комнаты. Апрель 2019 г.">
              <figcaption>Скриншот видео с камеры наблюдения из отделения милиции. Борис утверждает, что 20 секунд записи исчезли. Борис на полу посреди комнаты. Апрель 2019 г.</figcaption>
            </figure>
          </div>

          <footer class="container-footer">
            <div class="container-i-text">
              <p>— Когда распыляют, жжёт, будто лицо засунули в печку, будто кожу сожгли на лице — ужасное ощущение.</p>
              <p>В какие бы двери я ни заходил — прокуратура, Следственный комитет, управление собственной безопасности МВД — мне говорят: «Почему ты с ними не проехал?» Я говорю: «Так не было никаких требований, объяснений». Он мне говорит: «Это власть!» Тебе сказали ехать — ты должен.</p>
              <p>Право на применение физической силы же не говорит о том, что надо калечить человека. А они говорят, что у них все правомерно было. Если раньше я думал, что в правоохранительные органы можно обратиться с чем-то, то сейчас, встречая человека в форме, я вспоминаю берцы, — поясняет Борис</p>
            </div>
          </footer>
        </div>
      </section>
      <!-- slide #3 end -->
        
      <!-- slide #4 start -->
      <section class="slide slide--04" id="history04">
        <div class="slide-background">
          <img src="./assets/images/slide-04/background.jpg" alt="Татьяна Самникова-Мастыкина, 32 года, волонтерка правозащитной организации, Минск">
        </div>

        <div class="container" id="slideContent04">
          <header class="container-header"> 
            <h2 class="section-title">Татьяна Самникова-Мастыкина</h2>
            <div class="section-description">32 года, волонтерка правозащитной организации, Минск</div>
          </header>

          <div class="container-i-text">
            <p>атьяна Самникова-Мастыкина вспоминает, как на День Воли в 2018-м ее и других волонтеров Белорусского Хельсинкского комитета задержали в центре Минска для проверки документов. Дальше повезли в РУВД, где во внутреннем дворике Таня и ее коллеги провели три часа, стоя лицом к стене. В отделении ее заставили пройти дактилоскопию, а потом удерживали силой, чтобы сфотографировать для базы правонарушителей.</p>
            <p>Из пояснений правоохранителей: Мастыкина отказывалась добровольно сдать отпечатки пальцев и сфотографироваться, ее предупреждали, что к ней могут применить силу, однако и после этого она сопротивлялась. В итоге один сотрудник «взял руку Мастыкиной и стал разгибать собранные в кулак пальцы рук, в это время она сопротивлялась, вырывалась» . Одновременно другой сотрудник «присел на корточки, обхватил ее ноги руками и стал удерживать» . Милиционеры держали ее руки, по очереди разгибали пальцы. При фотосъемке удерживали ее голову, чтобы сделать снимок лица.</p>
            <p>В постановлении следователя об отказе в возбуждении уголовного дела указывается, что Мастыкина отказалась пройти судебно-медицинскую экспертизу, так как на ее теле не было повреждений. В возбуждении уголовного дела отказано, поскольку по мнению следствия, сотрудники милиции в рамках закона применили силу, так как задержанная отказывалась добровольно пройти дактилоскопию и фотографирование.</p>
            <figure>
              <img src="./assets/images/slide-04/image-01.jpg" alt="Главный вход в отделение милиции, где содержалась Татьяна. Минск. Апрель 2019 г.">
              <figcaption>Главный вход в отделение милиции, где содержалась Татьяна. Минск. Апрель 2019 г.</figcaption>
            </figure>
          </div>

          <footer class="container-footer">
            <div class="container-i-text">
              <p>— Я пыталась отстоять право на неприкосновенность, - говорит наша героиня. — Я не хотела давать отпечатки пальцев, просто потому что меня припугнули и скрутили.</p>
              <p>Сопротивляться было больно и сложно. Но было важно показать милиционерам, что они неправы и превышают свои полномочия. Мне было важно не сдаваться, отстаивать то, во что я верю.</p>
              <p>Страшно стало, когда домой пришла, адреналин слетел, пришло осознание, что произошло. Тогда меня начало трясти, дрожал голос, стало очень страшно, больно, и эту боль очень хотелось выразить. Любое насилие сложно осознать, принять себя в этой ситуации и отпустить: сделать правильные выводы, понять, что твоей вины здесь нет, и дальше жить с этим опытом.</p>
            </div>
          </footer>
        </div>
      </section>
      <!-- slide #4 end -->

      <!-- last slide start -->
      <section class="slide slide--outro" id="outro">
        <div class="slide-background">
          <img src="./assets/images/slide-outro/background.jpg" alt="Что делать, если милиция применяет силу?"/>
        </div>
        
        <div class="container" id="slideContentOutro">
          <div class="container-i-text">
            <h3>Что делать, если милиция применяет силу?</h3>
            <p>Можно ли дать отпор милиции? Задираться и провоцировать милицию однозначно не стоит. Если возник конфликт, постарайтесь спокойно, словами, донести, что вы не нарушаете закон и применять к вам силу неоправданно. Если силу применяет сотрудник в штатском, попытайтесь узнать, на каком основании, попросите показать удостоверение. Нужно понимать: на практике суды чаще доверяют сотрудникам правоохранительных органов, чем простым гражданам, особенно если гражданин был в состоянии опьянения (это всегда отягощает вину!). За физический отпор вас могут привлечь к ответственности уже за сопротивление — до пяти лет ограничения или лишения свободы (ч. 2 ст. 363 УК). </p>
            <p>Если у вас не успели забрать телефон, постарайтесь сделать фото, аудио или видео происходящего. Стоит также запомнить, были ли очевидцы вашего конфликта, их объяснения могут вам помочь, когда вы будете обжаловать незаконные действия правоохранителей. При задержании сотрудники имеют право забрать ваши личные вещи и телефон, постарайтесь до этого сообщить родным о задержании и сразу выключьте телефон.  По вашей просьбе сотрудники милиции должны позвонить вашим родственникам не позднее чем через три часа после задержания. С момента задержания вы имеете право на помощь адвоката. Часто это требование игнорируют. Но настаивайте на своем. Вы имеете право не отвечать на вопросы и не подписывать протокол до того, как приедет дежурный адвокат или адвокат, с которым заключат договор ваши родственники. То же самое и в суде.</p>
            <p>Вы можете обратиться не только к адвокатам, но и к правозащитникам, горячая линия — +375 29 841-39-81.</p>
            <p>Заявление вы можете подать в отделение милиции, но лучше его оставить в Следственном комитете. Четко укажите обстоятельства случившегося. В Следственном комитете вам должны выдать постановление, чтобы вы могли пройти экспертизу на наличие телесных повреждений. Но не в ближайшей поликлинике, а в специальном отделе экспертиз, который работает до 17.30. Поэтому если вас избили, например, в четверг вечером, ждать придется до пятницы. А пока можно обратиться в больницу, особенно если вы чувствуете недомогание. Подробно опишите дежурному доктору свое состояние. Даже если нет синяков, но вы чувствуете острую боль, вам должны сделать УЗИ и рентген. Документы из больницы сохраните, чтобы подтвердить, что увечья вы получили во время задержания, а не позже. Если вы плохо чувствуете себя, находясь в милиции, требуйте вызвать «скорую» прямо туда. Вам не имеют право отказать.</p>
            <p>В Беларуси были случаи, когда милиционеров привлекали к ответственности за издевательства над подозреваемыми. При этом стоит признать, что часто из СК приходит стандартный ответ — в действиях сотрудников органов внутренних дел нет состава преступления. Правозащитники считают, что ситуацию можно изменить только активной правовой позицией - чем чаще белорусы будут жаловаться на нарушения со стороны милиции, тем проще будет бороться с этой проблемой.</p>
          </div>
          
          <footer class="container-footer">
            <div class="container-i-text">
              <h3>Над проектом работали:</h3>
              <p>Автор проекта: Максим Сарычев</p>
              <p>Фото: Максим Сарычев</p>
              <p>Текст: Максим Сарычев, Адарья Гуштын</p>
              <p>Редактор: Марина Золотова</p>
              <p>Вёрстка: Валерий Кацкель</p>
              <p>Продюсер: Юлия Волчек, Никита Пузик</p>
              <div class="b-footnote">
                <p>Заглавное фото: наручники прикреплены к джипу, припаркованному в центре Минска. Финальное фото: колючая проволока на заборе, окружающем отделение милиции, где содержалась Татьяна.</p>
              </div>
            </div>
          </footer>
        </div>
      </section>
      <!-- last slide end -->
    </div>

    <footer class="app-footer">
      <div class="container">
        <div class="container-i-text">
          <div class="footer-copyright">
            <p>© ООО «ТУТ БАЙ МЕДИА», 2000 — 2019</p>
          </div>
          <div class="footer-social">
            <social-sharing url="https://vuejs.org/"
              title="Сопротивление бесполезно"
              description="Истории людей, которые заявили о насилии со стороны милиции"
              quote="Истории белорусов, которые заявили о насилии со стороны милиции и о которых рассказывает в своем фотопроекте Максим Сарычев, произошли более года назад"
              hashtags="tutby,tut.by,Спецпроект TUT.BY"
              twitter-user="vuejs"
              inline-template>
              <div>
                <network network="facebook"></network>
                <network network="vk"></network>
                <network network="twitter"></network>
                <network network="odnoklassniki"></network>
              </div>
            </social-sharing>
          </div>
        </div>
      </div>
    </footer>
  </div>
</template>

<script>
import ReadMoreIndicator from './components/ReadMoreIndicator.vue'

export default {
  name: 'app',
  components: {
    ReadMoreIndicator
  },
  mounted () {
    // инициализируем контролллер ScrollMagic
    // var controller = new ScrollMagic.Controller();
    // // создаем новый таймлайн для анимаций (новую анимацию)
    // var tl = new TimelineLite();
    // tl
    //   //.to('.container-header', 3, {y: -850, opacity: 0.0})                          // анимируем заголовок титульного слайда
    //   //.add("end", 3)                                                // добавляем контрольную точку на 3 секунды
    //   .to('.slide-background img', 3, {opacity: 0.0,})         // анимируем фон титульного слайда   
    
    
    // // создадим сцену для анимации первого слайда
    // new ScrollMagic.Scene({
    //   duration: "270%",                                             // задаем длительность сцены в процентах, 100% это одна высота вьюпорта (экрана)
    //   offset: "200",                                                    // смещение срабатывания триггера
    //   triggerElement: "#sectionContentIntro",                                       // селектор элемента-триггера
    //   triggerHook: "0",                                       // каким образом будет срабатывать триггер
    // })
    //   //.setPin("#sectionContentIntro")                                               
    //   .setTween(tl)
    //   .addIndicators({
    //     name: 'firstSlide'
    //   }) // add indicators (requires plugin)
    //   .addTo(controller);
  }
}
</script>

<style lang="scss">
body {
  margin: 0;
  padding: 0;
  font-family: Helvetica, sans-serif;
  background: black;
  color: #fff;
}

// layout start
.container {
  width: 700px;
  margin: 0 auto;
  box-sizing: border-box;

  .container-i-text {
    padding-left: 50px;
    padding-right: 50px;
    padding-top: 55px;
    width: 100%;
    box-sizing: border-box;
    padding-bottom: 55px;
    
    p {
      color: #fff;
      font-size: 17px;
      line-height: 25px;
      margin: 0;
    }

    h3 {
      margin: 0;
      font-size: 17px;
      line-height: 25px;
    }

    figure {
      margin: 50px -50px 0;
    }
  }
}
// layout end

.spacerBetweenSlides {
  height: 200vh;
}

.spacer50 {
  height: 50vh;
}

.slide {
  position: relative;
  width: 100%;

  .slide-background {
    position: relative;
    max-width: 100vw;

    img {
      width: 100%;
      object-fit: cover;
    }
  }
  
  .container-header {
    text-align: center;

    .section-title {
      margin: 0;
      font-size: 50px;
      line-height: 52px;
      color: #fff;
      font-weight: bold;
    }

    .section-description {
      font-size: 19px;
      line-height: 30px;
    }
  }
  
  .container-i-text {
    p {
      font-size: 17px;
      line-height: 25px;
      margin-top: 25px;
      margin-bottom: 0;

      &:first-child {
        margin-top: 0;
      }
    }
  }

  .container-footer {
    .container-i-text {
      background: rgba(66, 17, 23, 0.7);
    }
  }
  
  .b-footnote {
    margin-top: 55px;

    p {
      color: rgba(255, 255, 255, 0.5);
      font-size: 13px;
      line-height: 18px;
    }
  }

  &.slide {
    &--intro,
    &--outro {
      .container-i-text {
        background: rgba(255, 255, 255, 0.05);
      }
    }
  }

  &.slide--intro {
    &__spacer-after-header {
      height: 55vh;
    }
    
    .section-title {
      font-size: 35px;
      line-height: 40px;
    }

    .slide-background {
      position: relative;
    }
  }

  &.slide--outro {
    .container-footer {
      .container-i-text {
        background: none;
        
        h3 {
          margin-bottom: 30px;
        }
        
        p {
          margin: 0;
        }
      }
    }
  }  
}

.app-footer {
  color: rgba(255, 255, 255, 0.5);
  margin-bottom: 65px;
  .container {
    .container-i-text{
      display: flex;
      align-items: center;
      
      .footer-copyright {
        p {
          font-family: Arial;
          font-size: 15px;
          line-height: 30px;
        }
      }
      
      .footer-social {
        text-align: right;
        div {
          height: 30px;
        }
      }
      
      .footer-copyright,
      .footer-social {
        width: 50%;
        
        span {
          cursor: pointer;
          display: inline-block;
          background-color: rgba(255, 255, 255, 0.2); 
          border-radius: 3px;
          margin-left: 5px;
          width: 30px;
          height: 30px;
          background-position: 50%;
          background-repeat: no-repeat;
          transition: background-color 300ms;

          &:hover {
            background-color: rgba(255, 255, 255, 0.35);
          }

          &:first-child {
            margin-left: 0;
          }

          &[data-link="#share-facebook"] {
            background-image: url('./assets/images/icons/icon-fb.png');
          }

          &[data-link="#share-vk"] {
            background-image: url('./assets/images/icons/icon-vk.png');
          }

          &[data-link="#share-twitter"] {
            background-image: url('./assets/images/icons/icon-fb.png');
          }

          &[data-link="#share-odnoklassniki"] {
            background-image: url('./assets/images/icons/icon-ok.png');
          }

        }
      }
    }
  }
}
</style>
